app/views/static_pages/home.html.erb


<% unless User.last.nil? %>
  <p>Pour acceder à ton profil clique <a href="users/<%=User.last.username%>">ici</a></p>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]